{"soils":[{"name":"Loamy Soil","description":"Loamy soil is a well-balanced soil type that contains a mixture of sand, silt, and clay particles. It is known for its ideal growing conditions for a wide range of plants. Loamy soil retains moisture well while allowing for good drainage, making it suitable for various crops.","ph_range":"6.0 - 7.0","organic_matter_content":"3% - 5%","nutrient_content":"Moderate","best_crops":"Tomatoes, Carrots, Lettuce","common_issues":"Overwatering may lead to root rot."},{"name":"Sandy Soil","description":"Sandy soil is characterized by its large sand particles and provides good drainage. However, it doesn't retain moisture effectively and may require more frequent irrigation. Sandy soil is suitable for crops that prefer well-drained conditions, such as carrots and potatoes.","ph_range":"5.5 - 7.0","organic_matter_content":"1% - 2%","nutrient_content":"Low","best_crops":"Carrots , Potatoes , Radishes","common_issues":"Low nutrient content may require additional fertilization."},{"name":"Clay Soil","description":"Clay soil has tiny particles that pack closely together, resulting in poor drainage. It retains moisture effectively but may become compacted. Clay soil is suitable for crops that can tolerate wet conditions, such as rice and certain types of wheat.","ph_range":"6.0 - 7.0","organic_matter_content":"2% - 3%","nutrient_content":"High","best_crops":"Rice , Wheat, Soybeans","common_issues":"Compaction may restrict root growth."},{"name":"Silt Soil","description":"Silt soil consists of fine particles that hold moisture well and offer good fertility. It provides a balance between sand and clay soils. Silt soil is suitable for a wide range of crops, including vegetables, fruits, and grains.","ph_range":"6.0 - 7.5","organic_matter_content":"2% - 4%","nutrient_content":"High","best_crops":["Corn","Beans","Apples"],"common_issues":"May compact over time, requiring aeration."},{"name":"Peat Soil","description":"Peat soil is rich in organic matter and originates from the accumulation of decomposed plant material. It has high water-holding capacity but can become acidic. Peat soil is suitable for acid-loving plants like blueberries and cranberries.","ph_range":"3.5 - 5.0","organic_matter_content":"60% - 90%","nutrient_content":"Low","best_crops":"Blueberries , Cranberries , Azaleas","common_issues":"Acidic nature may require lime application."},{"name":"Chalky Soil","description":"Chalky soil, also known as alkaline soil, contains a high level of calcium carbonate. It has good drainage but may be less fertile. Chalky soil is suitable for crops that thrive in alkaline conditions, such as broccoli and asparagus.","ph_range":"7.5 - 8.5","organic_matter_content":"1% - 3%","nutrient_content":"Moderate","best_crops":"Broccoli , Asparagus , Cabbage","common_issues":"May lead to nutrient lockout in acidic-loving plants."}]}